README.org
虚存管理模拟程序开发文档
程序开发：田勇(39051718)

组员：王博弘，梁炯潜，郭莉莎
* 需求说明：
开发一个虚拟内存模拟程序，可以很好地模拟操作系统对虚拟内存的管理。该模拟程序实现以下模拟需求：
1. 基本需求
   1. 采用页式存储管理;
   2. 实现对缺页中断;
2. 高级需求
   1. 实现多道程序虚存管理.
   2. 实现２级页表
   3. 实现快表
   4. 通过FIFO管道实现多进程间通信。
3. 更高级需求（创新点)
   1. 实现内存共享
   2. 实现写时复制
   3. 模拟程序加载过程
   4. 实现最近最少使用替换算法

* 主要数据结构
** 物理页面结构page\_t
#+BEGIN_SRC -t
typedef struct{
        int lock;// equals to refer number minus 1
	bool accessed;
	byte_t freq;
	pte_t *ref_pte;
	int block; /* block in the  */
}page_t;
#+END_SRC
| lock     | 页面锁         | 记录当前物理页的引用                                       | -1:没有被引用; 0: 1个引用; >0:多个引用，页面被锁住，不允许交换 |
| accessed | 访问位         | 在一个刷新周期内是否被访问过                                | 刷新周期到来时，将全部表项置FALSE,每次对页面访问，都将其置为True  |
| freq     | 最近使用频率   | 保存当页面被访问信息，用于页面替换                         | 见[[最近最少使用算法]]                                             |
| ref\_pte | 引用页表项指针 | 当有多个页表项引用时，只保留一个，如果没有引用，则置为NULL |                                                                |
| block    | 外存块号       | 指向外存中数据所在的块                                     |                                                                |

** 快表项结构tlbe\_t
#+BEGIN_SRC -t
/* TLB enty type */
typedef struct{
	int vpage; // virtual page
	int ppage;// physic page
	bool edited;
	mod_t mode;
	bool valid;//True if it's used.
	int freq;
}tlbe_t;
#+END_SRC
| vpage  | 虚页号   |                                  |                                 |
| ppage  | 物理页号 |                                  |                                 |
| edited | 修改位   | 指向的页面是否被修改             |                                 |
| mode   | 页面标志 | 页面的读、写、执行权限及是否写时复制 |                                 |
| valid  | 有效位   | 当前表项是否有效                 | 　TRUE:表项可用，FALSE:表项无用  |
| frep   | 使用频率 | 记录表项访问频率，用于实现快表项替换 | 见[[快表]]的实现                |

** 页表项pte\_t
#+BEGIN_SRC -t
typedef struct {
	bool valid;//in memory?
	bool swapped;// TRUE if in swap; FALSE if in FS
	bool edited;
	
	mod_t mode;
	//	bool copy; // write on copy

	int page_ID;
}pte_t;
#+END_SRC
| valid   | 有效位   | 　当前页是否在内存               |                                   |
| swapped | 交换位   | 当前页是否已经交换               |                                   |
| edited  | 修改位   | 页面是否已经修改                 |                                   |
| mode    | 页面标志 | 页面的读、写、执行权限及是否写时复制 |                                   |
| page\_ID | 页号     | 物理页号或外存块号               | 　-1：指向全０页面; >0:页号或块号 |

** 程序结构program\_t
#+BEGIN_SRC -t
typedef struct{
	int start_block;// the first block in the disk.
	int data; //the length of data area, whitch is readonly
	int text;//length of text area, whitch is readonly and excutable
}program_t;
#+END_SRC
| start\_block | 起始块号         | 程序在外存中第一块所在的块号　 |
| data        | 数据段大小（页） | 程序数据段所占的页数           |
| text        | 程序段大小       | 程序程序段所占的页数           |

** 页表目录pgd\_t
#+BEGIN_SRC -t
typedef pte_t* pgd_t;
#+END_SRC

** 进程控制块task\_t
#+BEGIN_SRC -t
typedef struct _task_t{
	pid_t pid;
	pgd_t *pgd;
	program_t *program;
	struct _task_t * next;
	int fifo_fd;
}task_t;
#+END_SRC
| pid     | 进程号   | 客户端进程的进程号，用于区分多个进程 |
| pgd     | 页目录表 | 指向目录数组的指针                   |
| program | 程序     | 进程对应的程序                       |
| next    | 下一个进程 |                                      |
| fifo\_fd | 管道描述符 | 该进程的输出管道                     |

** 指令command\_t
#+BEGIN_SRC -t
typedef enum{
	NEW_TASK,
	READ,
	WRITE,
	EXEC,
	RUN,
	DISPLAY,
	QUIT,
}command_t;
#+END_SRC
| NEW\_TASK | 新进程指令 |
| READ     | 读内存指令 |
| WRITE    | 　写内存指令 |
| EXEC     | 执行内存指令 |
| RUN      | 运行程序指令 |
| DISPLAY  | 显示页表信息指令 |
| QUIT     | 进程退出指令     |

** 请求request\_t
#+BEGIN_SRC -t
typedef struct{
	pid_t pid;
	command_t command;
	address_t address;
	byte_t value;
}request_t;
#+END_SRC
| pid     | 进程id |
| command | 请求命令 |
| address | 请求地址 |
| value   | 请求值   |

** 外存块结构fs\_block\_t
#+BEGIN_SRC -t
typedef struct _block_t{
	int page_ID;//if loaded, the phisic page
	int count; // reference count
}fs_block_t;
#+END_SRC
| page\_ID | 页号　 | 如果当前页被装入内存，其所在的页面号 |
| count   | 引用数 | 使用当前块的进程数                   |

