README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>虚存管理模拟程序开发文档</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-12 22:38:30 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">虚存管理模拟程序开发文档</h1>

<p>程序开发：田勇(39051718)
</p>
<p>
组员：王博弘，梁炯潜，郭莉莎
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 需求说明： </a></li>
<li><a href="#sec-2">2 主要数据结构 </a>
<ul>
<li><a href="#sec-2.1">2.1 物理页面结构page_t </a></li>
<li><a href="#sec-2.2">2.2 快表项结构tlbe_t </a></li>
<li><a href="#sec-2.3">2.3 页表项pte_t </a></li>
<li><a href="#sec-2.4">2.4 程序结构program_t </a></li>
<li><a href="#sec-2.5">2.5 页表目录pgd_t </a></li>
<li><a href="#sec-2.6">2.6 进程控制块task_t </a></li>
<li><a href="#sec-2.7">2.7 指令command_t </a></li>
<li><a href="#sec-2.8">2.8 请求request_t </a></li>
<li><a href="#sec-2.9">2.9 外存块结构fs_block_t </a></li>
<li><a href="#sec-2.10">2.10 mod_t </a></li>
<li><a href="#sec-2.11">2.11 address_t byte_t bool </a></li>
</ul>
</li>
<li><a href="#sec-3">3 主要模块 </a>
<ul>
<li><a href="#sec-3.1">3.1 虚拟机模块:vmachine.c </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1 作用 </a></li>
<li><a href="#sec-3.1.2">3.1.2 主要数据 </a></li>
<li><a href="#sec-3.1.3">3.1.3 主要函数 </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 进程控制模块task.c </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1 作用 </a></li>
<li><a href="#sec-3.2.2">3.2.2 数据 </a></li>
<li><a href="#sec-3.2.3">3.2.3 主要函数 </a></li>
</ul>
</li>
<li><a href="#sec-3.3">3.3 页帧模块memmap.c </a>
<ul>
<li><a href="#sec-3.3.1">3.3.1 作用 </a></li>
<li><a href="#sec-3.3.2">3.3.2 数据 </a></li>
<li><a href="#sec-3.3.3">3.3.3 主要函数 </a></li>
</ul>
</li>
<li><a href="#sec-3.4">3.4 快表模块tlb.c </a>
<ul>
<li><a href="#sec-3.4.1">3.4.1 作用 </a></li>
<li><a href="#sec-3.4.2">3.4.2 数据 </a></li>
<li><a href="#sec-3.4.3">3.4.3 主要函数 </a></li>
</ul>
</li>
<li><a href="#sec-3.5">3.5 设备模块 </a>
<ul>
<li><a href="#sec-3.5.1">3.5.1 作用 </a></li>
<li><a href="#sec-3.5.2">3.5.2 主要数据 </a></li>
<li><a href="#sec-3.5.3">3.5.3 主要函数 </a></li>
</ul>
</li>
<li><a href="#sec-3.6">3.6 静态程序模块 </a>
<ul>
<li><a href="#sec-3.6.1">3.6.1 作用 </a></li>
<li><a href="#sec-3.6.2">3.6.2 数据 </a></li>
</ul>
</li>
<li><a href="#sec-3.7">3.7 客户终端模块tty.c </a>
<ul>
<li><a href="#sec-3.7.1">3.7.1 作用： </a></li>
<li><a href="#sec-3.7.2">3.7.2 主要数据 </a></li>
<li><a href="#sec-3.7.3">3.7.3 主要函数 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 功能实现 </a>
<ul>
<li><a href="#sec-4.1">4.1 快表 </a></li>
<li><a href="#sec-4.2">4.2 2级页表管理 </a></li>
<li><a href="#sec-4.3">4.3 程序加载 </a></li>
<li><a href="#sec-4.4">4.4 进程控制 </a></li>
<li><a href="#sec-4.5">4.5 最近最少使用算法 </a></li>
<li><a href="#sec-4.6">4.6 内存共享 </a>
<ul>
<li><a href="#sec-4.6.1">4.6.1 fork操作 </a></li>
<li><a href="#sec-4.6.2">4.6.2 加载相同程序 </a></li>
<li><a href="#sec-4.6.3">4.6.3 共享页面的交换处理 </a></li>
</ul>
</li>
<li><a href="#sec-4.7">4.7 缺页处理 </a></li>
<li><a href="#sec-4.8">4.8 写时复制的实现 </a></li>
<li><a href="#sec-4.9">4.9 多道程序并发及客户终端与虚拟机通信的实现 </a>
<ul>
<li><a href="#sec-4.9.1">4.9.1 多道程序实现 </a></li>
<li><a href="#sec-4.9.2">4.9.2 通信 </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 运行说明 </a></li>
<li><a href="#sec-6">6 测试说明 </a></li>
<li><a href="#sec-7">7 总结与感想 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 需求说明： </h2>
<div class="outline-text-2" id="text-1">

<p>开发一个虚拟内存模拟程序，可以很好地模拟操作系统对虚拟内存的管理。该模拟程序实现以下模拟需求：
</p><ol>
<li>
基本需求
<ol>
<li>
采用页式存储管理;
</li>
<li>
实现对缺页中断;
</li>
</ol>
</li>
<li>
高级需求
<ol>
<li>
实现多道程序虚存管理.
</li>
<li>
实现２级页表
</li>
<li>
实现快表
</li>
<li>
通过FIFO管道实现多进程间通信。
</li>
</ol>
</li>
<li>
更高级需求（创新点)
<ol>
<li>
实现内存共享
</li>
<li>
实现写时复制
</li>
<li>
模拟程序加载过程
</li>
<li>
实现最近最少使用替换算法

</li>
</ol>
</li>
</ol>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 主要数据结构 </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> 物理页面结构page_t </h3>
<div class="outline-text-3" id="text-2.1">




<pre class="example">typedef struct{
        int lock;// equals to refer number minus 1
        bool accessed;
        byte_t freq;
        pte_t *ref_pte;
        int block; /* block in the  */
}page_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>lock</td><td>页面锁</td><td>记录当前物理页的引用</td><td>-1:没有被引用; 0: 1个引用; &gt;0:多个引用，页面被锁住，不允许交换</td></tr>
<tr><td>accessed</td><td>访问位</td><td>在一个刷新周期内是否被访问过</td><td>刷新周期到来时，将全部表项置FALSE,每次对页面访问，都将其置为True</td></tr>
<tr><td>freq</td><td>最近使用频率</td><td>保存当页面被访问信息，用于页面替换</td><td>见<a href="#sec-2.1">最近最少使用算法</a></td></tr>
<tr><td>ref_pte</td><td>引用页表项指针</td><td>当有多个页表项引用时，只保留一个，如果没有引用，则置为NULL</td><td></td></tr>
<tr><td>block</td><td>外存块号</td><td>指向外存中数据所在的块</td><td></td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.2" class="outline-3">
<h3 id="sec-2.2"><span class="section-number-3">2.2</span> 快表项结构tlbe_t </h3>
<div class="outline-text-3" id="text-2.2">




<pre class="example">/* TLB enty type */
typedef struct{
        int vpage; // virtual page
        int ppage;// physic page
        bool edited;
        mod_t mode;
        bool valid;//True if it's used.
        int freq;
}tlbe_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>vpage</td><td>虚页号</td><td></td><td></td></tr>
<tr><td>ppage</td><td>物理页号</td><td></td><td></td></tr>
<tr><td>edited</td><td>修改位</td><td>指向的页面是否被修改</td><td></td></tr>
<tr><td>mode</td><td>页面标志</td><td>页面的读、写、执行权限及是否写时复制</td><td></td></tr>
<tr><td>valid</td><td>有效位</td><td>当前表项是否有效</td><td>　TRUE:表项可用，FALSE:表项无用</td></tr>
<tr><td>frep</td><td>使用频率</td><td>记录表项访问频率，用于实现快表项替换</td><td>见<a href="#sec-1">快表</a>的实现</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.3" class="outline-3">
<h3 id="sec-2.3"><span class="section-number-3">2.3</span> 页表项pte_t </h3>
<div class="outline-text-3" id="text-2.3">




<pre class="example">typedef struct {
        bool valid;//in memory?
        bool swapped;// TRUE if in swap; FALSE if in FS
        bool edited;
        
        mod_t mode;
        //      bool copy; // write on copy

        int page_ID;
}pte_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>valid</td><td>有效位</td><td>　当前页是否在内存</td><td></td></tr>
<tr><td>swapped</td><td>交换位</td><td>当前页是否已经交换</td><td></td></tr>
<tr><td>edited</td><td>修改位</td><td>页面是否已经修改</td><td></td></tr>
<tr><td>mode</td><td>页面标志</td><td>页面的读、写、执行权限及是否写时复制</td><td></td></tr>
<tr><td>page_ID</td><td>页号</td><td>物理页号或外存块号</td><td>　-1：指向全０页面; &gt;0:页号或块号</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.4" class="outline-3">
<h3 id="sec-2.4"><span class="section-number-3">2.4</span> 程序结构program_t </h3>
<div class="outline-text-3" id="text-2.4">




<pre class="example">typedef struct{
        int start_block;// the first block in the disk.
        int data; //the length of data area, whitch is readonly
        int text;//length of text area, whitch is readonly and excutable
}program_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>start_block</td><td>起始块号</td><td>程序在外存中第一块所在的块号　</td></tr>
<tr><td>data</td><td>数据段大小（页）</td><td>程序数据段所占的页数</td></tr>
<tr><td>text</td><td>程序段大小</td><td>程序程序段所占的页数</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.5" class="outline-3">
<h3 id="sec-2.5"><span class="section-number-3">2.5</span> 页表目录pgd_t </h3>
<div class="outline-text-3" id="text-2.5">




<pre class="example">typedef pte_t* pgd_t;
</pre>




</div>

</div>

<div id="outline-container-2.6" class="outline-3">
<h3 id="sec-2.6"><span class="section-number-3">2.6</span> 进程控制块task_t </h3>
<div class="outline-text-3" id="text-2.6">




<pre class="example">typedef struct _task_t{
        pid_t pid;
        pgd_t *pgd;
        program_t *program;
        struct _task_t * next;
        int fifo_fd;
}task_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>pid</td><td>进程号</td><td>客户端进程的进程号，用于区分多个进程</td></tr>
<tr><td>pgd</td><td>页目录表</td><td>指向目录数组的指针</td></tr>
<tr><td>program</td><td>程序</td><td>进程对应的程序</td></tr>
<tr><td>next</td><td>下一个进程</td><td></td></tr>
<tr><td>fifo_fd</td><td>管道描述符</td><td>该进程的输出管道</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.7" class="outline-3">
<h3 id="sec-2.7"><span class="section-number-3">2.7</span> 指令command_t </h3>
<div class="outline-text-3" id="text-2.7">




<pre class="example">typedef enum{
        NEW_TASK,
        READ,
        WRITE,
        EXEC,
        RUN,
        DISPLAY,
        QUIT,
}command_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>NEW_TASK</td><td>新进程指令</td></tr>
<tr><td>READ</td><td>读内存指令</td></tr>
<tr><td>WRITE</td><td>　写内存指令</td></tr>
<tr><td>EXEC</td><td>执行内存指令</td></tr>
<tr><td>RUN</td><td>运行程序指令</td></tr>
<tr><td>DISPLAY</td><td>显示页表信息指令</td></tr>
<tr><td>QUIT</td><td>进程退出指令</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.8" class="outline-3">
<h3 id="sec-2.8"><span class="section-number-3">2.8</span> 请求request_t </h3>
<div class="outline-text-3" id="text-2.8">




<pre class="example">typedef struct{
        pid_t pid;
        command_t command;
        address_t address;
        byte_t value;
}request_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>pid</td><td>进程id</td></tr>
<tr><td>command</td><td>请求命令</td></tr>
<tr><td>address</td><td>请求地址</td></tr>
<tr><td>value</td><td>请求值</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.9" class="outline-3">
<h3 id="sec-2.9"><span class="section-number-3">2.9</span> 外存块结构fs_block_t </h3>
<div class="outline-text-3" id="text-2.9">




<pre class="example">typedef struct _block_t{
        int page_ID;//if loaded, the phisic page
        int count; // reference count
}fs_block_t;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>page_ID</td><td>页号　</td><td>如果当前页被装入内存，其所在的页面号</td></tr>
<tr><td>count</td><td>引用数</td><td>使用当前块的进程数</td></tr>
</tbody>
</table>


</div>

</div>
