README.org
** mod\_t
#+BEGIN_SRC -t
typedef unsigned char mod_t;
#define MODE_RWX 0x07
#define MODE_RW 0x06
#define MODE_W 0x02
#define MODE_R 0x04
#define MODE_X 0x01
#define MODE_C 0x08
#+END_SRC
| MODE\_RWX | 可读、可写、可执行 |
| MODE\_RW | 可读、可写         |
| MODE\_W  | 只写               |
| MODE\_R  | 只读               |
| MODE\_X  | 只执行             |
| MODE\_C  | 写时复制           |

** address\_t byte\_t bool
#+BEGIN_SRC -t
typedef unsigned short address_t;
typedef unsigned char  byte_t;

typedef enum{
	TRUE = 1,
	FALSE = 0,
}bool;
#+END_SRC
| address\_t | 虚拟程序的地址 | １６位 | 采用１６进制表示，如2a7b |
| byte\_t  | 虚拟程序的字节 | 8位    | １６进制，如3e           |

* 主要模块
** 虚拟机模块:vmachine.c
*** 作用
虚拟机模块是整个模拟程序的核心，负责对请求的应答和从虚地址空间到物理地址之间的转换，在转化期间发生
的页表的动态生成、管理、释放，也由虚拟机模块管理。
*** 主要数据
**** Memory
Memory本模拟程序所模拟的内存，共MEM\_SIZE字节。通过对MEM\_SIZE的调节，可以控制物理内存的大少。
MEM_SIZE应当是PAGE_SIZE的整数倍。
**** Address和AddrMode
Address模拟地址寄存器，保存对虚拟地址的进行转化后得到的实地址。

AddrMode保存对物理地址所在页的标志，包括读、写、执行权限和写时复制标志。
**** Buffer
Buffer作为缓冲区，用于与客户端程序进行通信。
*** 主要函数
**** void mmap\_refresh\_handler(int sig)
处理时钟信息，用于实现最近最少使用原则算法。当时钟信号到来时，调用memap\_refresh函数，对物理页
面更新，并重新设置时钟来激发下一次更新。
**** void start\_machine()
起动虚拟机，调用各个模块的初始化函数对各个模块进行初使化。
**** void shutdown\_machine()
关闭虚拟机，释放资源。
**** void display(char *info), void dispaly\_apgetable(task\_t *task)
显示进程页表信息，并将信息通过FIFO传给客户端程序。
**** do\_response(request\_t *request)
对请求进行回应。
   1. 如果请求类型为NEW\_TASK,则创建一个新的进程
   2. 如果请求的进程不是当前进程，则将进程切换到当前进程，切换过程要将快表清空。
   3. 如果请类型是WRITE,READ,EXEC则将地址转化为物理地址，转化过程中处理缺页、置换、加载等情况。
   4. 如果请求类型是RUN,则进行加载新程序替换当前程序。
   5. 如果请求类型是QUIT,则释放当前进程资源。

**** pte\_t *lookup\_pgt(address\_t vaddr)
查找页表，将物理地地和物理页面的标志分别存入Address和AddrMode。在此过程中进行缺页处理、页面管理
、加载、共享等操作。

**** bool access\_addr(address\_t vaddr, command\_t cmd)
对READ,WRITE,EXEC进行操作，并判断是否有进行该操作的权限。该函数先查找TLB是否有要查找的页面，如
果没有，则查找页表，并将结果存入TLB中。对权限进行验证后，执行操作，并返回结果。

**** void vm\_fork(pid_t child\_id, task\_t *ptask)
对ptask进程进行fork,产生一个进程id为child\_id的子进程。子进程并不立刻分配内存空间，而是和父进
程共享内存，但此时父进程和子进程的页面全部标记为写时复制。
**** void pgd\_deep\_clone(task *task)
产生一个和task共享内存的进程的内表项。
**** exec\_program(task\_t *task, program\_t *pro), load\_program(task\_t task, program\_t *pro)
用一个新程序替换进程的程序，重新分配页表，将其定位到对应的外存或内存页面。
**** lazy\_load(task\_t *task, int page)
对进程task的page页面进行“懶加载“：只将对应的外存块号写入页表，而外存中的页面并不加载到内存，留到
访问到该页面时再进行加载。
**** reset_pte(const pte\_t *pte), free\_pgd(pgd\_t pgd)
释放对应的页目录和页表。
**** main()
程序入口。

** 进程控制模块task.c
*** 作用
控制进行程的创建、切换、终止。
*** 数据
**** TaskInit
模拟Linux系统中的init进程。在本模拟程序中，任何其它进行都由TaskInit进程fork出来，然后调用
EXEC命令加载其它程序。
**** CurTask
当前进程的指针。
*** 主要函数
**** void init\_task()
初始化进程模块，设定TaskInit进程，加载其程序。
**** task\_t *new\_task(pid\_t pid, pgd\_t *pgd)
生成一人进程号为pid,页目录为pgd的新进程。
**** bool switch\_task(pid\_t pid)
将当前进程切换到pid进程。
**** task\_t *free\_task(task\_t *task)
释放task进程的资源
**** void kill\_task(pid\_t pid)
删除进程号为pid的进程。
** 页帧模块memmap.c
*** 作用
控制物理页面的加载、交换、保护、共享，维护空闲页面清单。
*** 数据
**** MemMap[MMap_SIZE]
MemMap的每一个页面对应着一个物理页面，负责维护该页面的信息。
*** 主要函数
**** void page\_in(pte\_t *pte)
处理缺页。先在页面中找出一个空页表（如果没有，调用page\_out换出一个),然后根据pte中的信息将页面
加载入内存。
   1. 如果swapped为True，则从交换区中将对应页面加载入内存
   2. 如果swapped为False，则从FSBlock中将页面加载到内存
   3. 如果page_ID为-1，则直接使用一块空页面，并将该页面全部置零。
**** void page\_out(int page\_id)
将page\_id交换出内存，如果页面没有修改过，直接丢弃该页面，并调用lazy\_load设置该页的外存块号。
**** int mempty\_page()
查找所有页面，如果lock为－１,则说明此页为空，返回该页号；如果没有，则在lock为0的页面中，寻找最近
最少使用的（即freq最小的)的页面将其交换出去，并返回该页页号。
**** void memmap\_refresh()
扫描所有的页面，将页面的freq右移一位，如果页面的accessed位为TRUE，则freq最高位置１，否则置０
。

** 快表模块tlb.c
*** 作用
模拟快表.
*** 数据
**** TLB{TLB_SIZE]
快表数据.
*** 主要函数
**** void init\_tlb()
初始化快表.
**** int lookup\_tlb(address\_t vaddress)
在TLB中查找vaddress的页面，如果没有，则对返回-1, 否则返回对应的下标，并将Address和AddrMode
设置为物理地址和页面标志。
**** void tlb2pgt(out), void pgt2tlb(int vpage, pte\_t *pte, int in)
控制在快表和页表之间相互传递。
**** int tlb\_swap(pte\_t *pte, int vpage)
在快表中交换出一个可用项，并填入pte的信息。
**** void tlb\_clear()
将所有快表项置为无效，进程切换时进行调用。

** 设备模块
*** 作用
模拟文件系统，管理磁盘文件和交换区资源。
*** 主要数据
**** SwapFile, FSFile
交换区文件和磁盘文件。当内存中页面使用完时，将会有页面被交换到SwapFile中，而在本模拟程序中，由于
程序指令由用户通过终端手工输入，所以FSFile并无实际作用。
**** SwapCount[SWAP_SIZE]
记录交换区中块引用次数。
**** FSBlock[FS_SIZE]
管理磁盘块的信息，具体字段含义见 [[外存块结构fs\_block\_t]]
*** 主要函数
**** int empty\_swap\_block()
在交换区中寻找一个空闲的块并返回其下标。
**** void swap\_in(byte\_t *mem, int block)
将swap区中的一块加载到mem指向的内存。
**** void load\_block(int mem, int block)
将文件系统中的一块加载到内存。
**** void swap\_out(byte\_t *mem)
将内存中的一页数据写入到交换区。

** 静态程序模块
*** 作用
提供多个程序的段信息，以便模拟程序加载过程序，而不是随机生成每一页的控制位。
*** 数据
**** Program[PROG\_N]
程序的数组。
** 客户终端模块tty.c
*** 作用：
模拟一个进程的终端，通过终端像虚拟机发送指令。
*** 主要数据
