README.html

<div id="outline-container-2.10" class="outline-3">
<h3 id="sec-2.10"><span class="section-number-3">2.10</span> mod_t </h3>
<div class="outline-text-3" id="text-2.10">




<pre class="example">typedef unsigned char mod_t;
#define MODE_RWX 0x07
#define MODE_RW 0x06
#define MODE_W 0x02
#define MODE_R 0x04
#define MODE_X 0x01
#define MODE_C 0x08
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>MODE_RWX</td><td>可读、可写、可执行</td></tr>
<tr><td>MODE_RW</td><td>可读、可写</td></tr>
<tr><td>MODE_W</td><td>只写</td></tr>
<tr><td>MODE_R</td><td>只读</td></tr>
<tr><td>MODE_X</td><td>只执行</td></tr>
<tr><td>MODE_C</td><td>写时复制</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2.11" class="outline-3">
<h3 id="sec-2.11"><span class="section-number-3">2.11</span> address_t byte_t bool </h3>
<div class="outline-text-3" id="text-2.11">




<pre class="example">typedef unsigned short address_t;
typedef unsigned char  byte_t;

typedef enum{
        TRUE = 1,
        FALSE = 0,
}bool;
</pre>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" /><col align="left" /><col align="left" />
</colgroup>
<tbody>
<tr><td>address_t</td><td>虚拟程序的地址</td><td>１６位</td><td>采用１６进制表示，如2a7b</td></tr>
<tr><td>byte_t</td><td>虚拟程序的字节</td><td>8位</td><td>１６进制，如3e</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 主要模块 </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> 虚拟机模块:vmachine.c </h3>
<div class="outline-text-3" id="text-3.1">


</div>

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1"><span class="section-number-4">3.1.1</span> 作用 </h4>
<div class="outline-text-4" id="text-3.1.1">

<p>虚拟机模块是整个模拟程序的核心，负责对请求的应答和从虚地址空间到物理地址之间的转换，在转化期间发生
的页表的动态生成、管理、释放，也由虚拟机模块管理。
</p></div>

</div>

<div id="outline-container-3.1.2" class="outline-4">
<h4 id="sec-3.1.2"><span class="section-number-4">3.1.2</span> 主要数据 </h4>
<div class="outline-text-4" id="text-3.1.2">

<ul>
<li id="sec-3.1.2.1">Memory <br/>
Memory本模拟程序所模拟的内存，共MEM_SIZE字节。通过对MEM_SIZE的调节，可以控制物理内存的大少。
MEM<sub>SIZE应当是PAGE</sub><sub>SIZE的整数倍。</sub>
</li>
<li id="sec-3.1.2.2">Address和AddrMode <br/>
Address模拟地址寄存器，保存对虚拟地址的进行转化后得到的实地址。

<p>
AddrMode保存对物理地址所在页的标志，包括读、写、执行权限和写时复制标志。
</p></li>
<li id="sec-3.1.2.3">Buffer <br/>
Buffer作为缓冲区，用于与客户端程序进行通信。
</li>
</ul>
</div>

</div>

<div id="outline-container-3.1.3" class="outline-4">
<h4 id="sec-3.1.3"><span class="section-number-4">3.1.3</span> 主要函数 </h4>
<div class="outline-text-4" id="text-3.1.3">

<ul>
<li id="sec-3.1.3.1">void mmap_refresh_handler(int sig) <br/>
处理时钟信息，用于实现最近最少使用原则算法。当时钟信号到来时，调用memap_refresh函数，对物理页
面更新，并重新设置时钟来激发下一次更新。
</li>
<li id="sec-3.1.3.2">void start_machine() <br/>
起动虚拟机，调用各个模块的初始化函数对各个模块进行初使化。
</li>
<li id="sec-3.1.3.3">void shutdown_machine() <br/>
关闭虚拟机，释放资源。
</li>
<li id="sec-3.1.3.4">void display(char *info), void dispaly_apgetable(task_t *task) <br/>
显示进程页表信息，并将信息通过FIFO传给客户端程序。
</li>
<li id="sec-3.1.3.5">do_response(request_t *request) <br/>
对请求进行回应。
<ol>
<li>
如果请求类型为NEW_TASK,则创建一个新的进程
</li>
<li>
如果请求的进程不是当前进程，则将进程切换到当前进程，切换过程要将快表清空。
</li>
<li>
如果请类型是WRITE,READ,EXEC则将地址转化为物理地址，转化过程中处理缺页、置换、加载等情况。
</li>
<li>
如果请求类型是RUN,则进行加载新程序替换当前程序。
</li>
<li>
如果请求类型是QUIT,则释放当前进程资源。

</li>
</ol>
</li>
<li id="sec-3.1.3.6">pte_t *lookup_pgt(address_t vaddr) <br/>
查找页表，将物理地地和物理页面的标志分别存入Address和AddrMode。在此过程中进行缺页处理、页面管理
、加载、共享等操作。

</li>
<li id="sec-3.1.3.7">bool access_addr(address_t vaddr, command_t cmd) <br/>
对READ,WRITE,EXEC进行操作，并判断是否有进行该操作的权限。该函数先查找TLB是否有要查找的页面，如
果没有，则查找页表，并将结果存入TLB中。对权限进行验证后，执行操作，并返回结果。

</li>
<li id="sec-3.1.3.8">void vm_fork(pid<sub>t</sub> child_id, task_t *ptask) <br/>
对ptask进程进行fork,产生一个进程id为child_id的子进程。子进程并不立刻分配内存空间，而是和父进
程共享内存，但此时父进程和子进程的页面全部标记为写时复制。
</li>
<li id="sec-3.1.3.9">void pgd_deep_clone(task *task) <br/>
产生一个和task共享内存的进程的内表项。
</li>
<li id="sec-3.1.3.10">exec_program(task_t *task, program_t *pro), load_program(task_t task, program_t *pro) <br/>
用一个新程序替换进程的程序，重新分配页表，将其定位到对应的外存或内存页面。
</li>
<li id="sec-3.1.3.11">lazy_load(task_t *task, int page) <br/>
对进程task的page页面进行“懶加载“：只将对应的外存块号写入页表，而外存中的页面并不加载到内存，留到
访问到该页面时再进行加载。
</li>
<li id="sec-3.1.3.12">reset<sub>pte</sub>(const pte_t *pte), free_pgd(pgd_t pgd) <br/>
释放对应的页目录和页表。
</li>
<li id="sec-3.1.3.13">main() <br/>
程序入口。

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> 进程控制模块task.c </h3>
<div class="outline-text-3" id="text-3.2">


</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1"><span class="section-number-4">3.2.1</span> 作用 </h4>
<div class="outline-text-4" id="text-3.2.1">

<p>控制进行程的创建、切换、终止。
</p></div>

</div>

<div id="outline-container-3.2.2" class="outline-4">
<h4 id="sec-3.2.2"><span class="section-number-4">3.2.2</span> 数据 </h4>
<div class="outline-text-4" id="text-3.2.2">

<ul>
<li id="sec-3.2.2.1">TaskInit <br/>
模拟Linux系统中的init进程。在本模拟程序中，任何其它进行都由TaskInit进程fork出来，然后调用
EXEC命令加载其它程序。
</li>
<li id="sec-3.2.2.2">CurTask <br/>
当前进程的指针。
</li>
</ul>
</div>

</div>

<div id="outline-container-3.2.3" class="outline-4">
<h4 id="sec-3.2.3"><span class="section-number-4">3.2.3</span> 主要函数 </h4>
<div class="outline-text-4" id="text-3.2.3">

<ul>
<li id="sec-3.2.3.1">void init_task() <br/>
初始化进程模块，设定TaskInit进程，加载其程序。
</li>
<li id="sec-3.2.3.2">task_t *new_task(pid_t pid, pgd_t *pgd) <br/>
生成一人进程号为pid,页目录为pgd的新进程。
</li>
<li id="sec-3.2.3.3">bool switch_task(pid_t pid) <br/>
将当前进程切换到pid进程。
</li>
<li id="sec-3.2.3.4">task_t *free_task(task_t *task) <br/>
释放task进程的资源
</li>
<li id="sec-3.2.3.5">void kill_task(pid_t pid) <br/>
删除进程号为pid的进程。
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> 页帧模块memmap.c </h3>
<div class="outline-text-3" id="text-3.3">


</div>

<div id="outline-container-3.3.1" class="outline-4">
<h4 id="sec-3.3.1"><span class="section-number-4">3.3.1</span> 作用 </h4>
<div class="outline-text-4" id="text-3.3.1">

<p>控制物理页面的加载、交换、保护、共享，维护空闲页面清单。
</p></div>

</div>

<div id="outline-container-3.3.2" class="outline-4">
<h4 id="sec-3.3.2"><span class="section-number-4">3.3.2</span> 数据 </h4>
<div class="outline-text-4" id="text-3.3.2">

<ul>
<li id="sec-3.3.2.1">MemMap[MMap<sub>SIZE]</sub> <br/>
MemMap的每一个页面对应着一个物理页面，负责维护该页面的信息。
</li>
</ul>
</div>

</div>

<div id="outline-container-3.3.3" class="outline-4">
<h4 id="sec-3.3.3"><span class="section-number-4">3.3.3</span> 主要函数 </h4>
<div class="outline-text-4" id="text-3.3.3">

<ul>
<li id="sec-3.3.3.1">void page_in(pte_t *pte) <br/>
处理缺页。先在页面中找出一个空页表（如果没有，调用page_out换出一个),然后根据pte中的信息将页面
加载入内存。
<ol>
<li>
如果swapped为True，则从交换区中将对应页面加载入内存
</li>
<li>
如果swapped为False，则从FSBlock中将页面加载到内存
</li>
<li>
如果page<sub>ID为</sub>-1，则直接使用一块空页面，并将该页面全部置零。
</li>
</ol>
</li>
<li id="sec-3.3.3.2">void page_out(int page_id) <br/>
将page_id交换出内存，如果页面没有修改过，直接丢弃该页面，并调用lazy_load设置该页的外存块号。
</li>
<li id="sec-3.3.3.3">int mempty_page() <br/>
查找所有页面，如果lock为－１,则说明此页为空，返回该页号；如果没有，则在lock为0的页面中，寻找最近
最少使用的（即freq最小的)的页面将其交换出去，并返回该页页号。
</li>
<li id="sec-3.3.3.4">void memmap_refresh() <br/>
扫描所有的页面，将页面的freq右移一位，如果页面的accessed位为TRUE，则freq最高位置１，否则置０
。

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4"><span class="section-number-3">3.4</span> 快表模块tlb.c </h3>
<div class="outline-text-3" id="text-3.4">


</div>

<div id="outline-container-3.4.1" class="outline-4">
<h4 id="sec-3.4.1"><span class="section-number-4">3.4.1</span> 作用 </h4>
<div class="outline-text-4" id="text-3.4.1">

<p>模拟快表.
</p></div>

</div>

<div id="outline-container-3.4.2" class="outline-4">
<h4 id="sec-3.4.2"><span class="section-number-4">3.4.2</span> 数据 </h4>
<div class="outline-text-4" id="text-3.4.2">

<ul>
<li id="sec-3.4.2.1">TLB{TLB<sub>SIZE]</sub> <br/>
快表数据.
</li>
</ul>
</div>

</div>

<div id="outline-container-3.4.3" class="outline-4">
<h4 id="sec-3.4.3"><span class="section-number-4">3.4.3</span> 主要函数 </h4>
<div class="outline-text-4" id="text-3.4.3">

<ul>
<li id="sec-3.4.3.1">void init_tlb() <br/>
初始化快表.
</li>
<li id="sec-3.4.3.2">int lookup_tlb(address_t vaddress) <br/>
在TLB中查找vaddress的页面，如果没有，则对返回-1, 否则返回对应的下标，并将Address和AddrMode
设置为物理地址和页面标志。
</li>
<li id="sec-3.4.3.3">void tlb2pgt(out), void pgt2tlb(int vpage, pte_t *pte, int in) <br/>
控制在快表和页表之间相互传递。
</li>
<li id="sec-3.4.3.4">int tlb_swap(pte_t *pte, int vpage) <br/>
在快表中交换出一个可用项，并填入pte的信息。
</li>
<li id="sec-3.4.3.5">void tlb_clear() <br/>
将所有快表项置为无效，进程切换时进行调用。

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.5" class="outline-3">
<h3 id="sec-3.5"><span class="section-number-3">3.5</span> 设备模块 </h3>
<div class="outline-text-3" id="text-3.5">


</div>

<div id="outline-container-3.5.1" class="outline-4">
<h4 id="sec-3.5.1"><span class="section-number-4">3.5.1</span> 作用 </h4>
<div class="outline-text-4" id="text-3.5.1">

<p>模拟文件系统，管理磁盘文件和交换区资源。
</p></div>

</div>

<div id="outline-container-3.5.2" class="outline-4">
<h4 id="sec-3.5.2"><span class="section-number-4">3.5.2</span> 主要数据 </h4>
<div class="outline-text-4" id="text-3.5.2">

<ul>
<li id="sec-3.5.2.1">SwapFile, FSFile <br/>
交换区文件和磁盘文件。当内存中页面使用完时，将会有页面被交换到SwapFile中，而在本模拟程序中，由于
程序指令由用户通过终端手工输入，所以FSFile并无实际作用。
</li>
<li id="sec-3.5.2.2">SwapCount[SWAP<sub>SIZE]</sub> <br/>
记录交换区中块引用次数。
</li>
<li id="sec-3.5.2.3">FSBlock[FS<sub>SIZE]</sub> <br/>
管理磁盘块的信息，具体字段含义见 <a href="#外存块结构fs\_block\_t">外存块结构fs_block_t</a>
</li>
</ul>
</div>

</div>

<div id="outline-container-3.5.3" class="outline-4">
<h4 id="sec-3.5.3"><span class="section-number-4">3.5.3</span> 主要函数 </h4>
<div class="outline-text-4" id="text-3.5.3">

<ul>
<li id="sec-3.5.3.1">int empty_swap_block() <br/>
在交换区中寻找一个空闲的块并返回其下标。
</li>
<li id="sec-3.5.3.2">void swap_in(byte_t *mem, int block) <br/>
将swap区中的一块加载到mem指向的内存。
</li>
<li id="sec-3.5.3.3">void load_block(int mem, int block) <br/>
将文件系统中的一块加载到内存。
</li>
<li id="sec-3.5.3.4">void swap_out(byte_t *mem) <br/>
将内存中的一页数据写入到交换区。

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.6" class="outline-3">
<h3 id="sec-3.6"><span class="section-number-3">3.6</span> 静态程序模块 </h3>
<div class="outline-text-3" id="text-3.6">


</div>

<div id="outline-container-3.6.1" class="outline-4">
<h4 id="sec-3.6.1"><span class="section-number-4">3.6.1</span> 作用 </h4>
<div class="outline-text-4" id="text-3.6.1">

<p>提供多个程序的段信息，以便模拟程序加载过程序，而不是随机生成每一页的控制位。
</p></div>

</div>

<div id="outline-container-3.6.2" class="outline-4">
<h4 id="sec-3.6.2"><span class="section-number-4">3.6.2</span> 数据 </h4>
<div class="outline-text-4" id="text-3.6.2">

<ul>
<li id="sec-3.6.2.1">Program[PROG_N] <br/>
程序的数组。
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3.7" class="outline-3">
<h3 id="sec-3.7"><span class="section-number-3">3.7</span> 客户终端模块tty.c </h3>
<div class="outline-text-3" id="text-3.7">


</div>

<div id="outline-container-3.7.1" class="outline-4">
<h4 id="sec-3.7.1"><span class="section-number-4">3.7.1</span> 作用： </h4>
<div class="outline-text-4" id="text-3.7.1">

<p>模拟一个进程的终端，通过终端像虚拟机发送指令。
</p></div>

</div>
