README.org
**** Buffer[BUFF\_SIZE]
用于与虚拟机通信，接收消息及输出指令的缓冲区。
**** Request
当前的请求。
**** Continue
是否继续，当用户输入q指令时，Continue将被置为FALSE,程序将释放资源准备退出。
*** 主要函数
**** bool parse\_command()
从终端中读一行指令，进其进行解析，将解析的结果保存在Request中。
**** int main()
程序入口，初始化资源，并向虚拟机发出NEW\_TASK指令，程序进入解析指令循环。

* 功能实现
** 快表
通过tble\_t TLB[TLB\_SIZE]进行模拟快表结构。虚拟机启动时，快表进行初始化，将所有表项置为无效
。每次访问地时，先从块表中查找有效且虚页号匹配的表项，并对所有表项的freq信息进行更新。当没有找到
时，再查找页表，并且根据查找到信息对快表进行更新。

快表只对当前进程有效，所以当程序进行切换进程时，快表将进行清空操作，将所有快表项置为无效。

** 2级页表管理
2级页表的好处是操作系统只需对需要的页表分配内存，从而可以节省大量内存。本模拟程序对此功能进行了很
好的模拟。

当新建一个进程时，页目录将会动态地被分配，然后只分配程序的data段页表和text段页表，对于堆栈断并不
分配其页表，只有当虚拟机需要访问该段时，才动态地分配该页表，并将其指内存的０块。

进程退出时，将先释放页表的指向的页面资源，再释放页表空间，最后释放目录空间。
** 程序加载
本模拟程序对实际程序的结构进行了简化，我们假设：
   1. 程序分为３个段：data段，只读;text；可读可执行；堆栈段，可读可写，不可执行。
   2. 程序中不包含共享库。
   3. 程序从地址０开始加载。

当程序加载时，data段和text段的页表立刻分配内存，通过lazy\_load将页表指内文件系统中的块地址，
但是此时并不将其数据加载到内存，而是延迟到对该数据进行操作时再加载。对于堆栈段内的页表，如果此时
已经在页目录中分配了，则将其指向０区，即将其page\_ID置为－１,否则不分配内存,留待使用时分配。

** 进程控制
虚拟机启动时，自动生成１号进程TaskInit，以后每启动一个客户终端，都将向虚拟机发送一个NEW\_TASK请
求。虚拟机接收到该请求后，通过模拟的fork操作生成一个新的Task，新的Task和TaskInit共享地址空间
，它们的页表指内相同的物理页。

当调用RUN请求时，虚拟机加载指定的新程序，替原进程的地址空间。

每次虚拟机接收到新请求时，都会检查请求是不来自当前进程，如果不是，调用switch\_task进行切换，同
时清空快表。

收到退出的请求时，虚拟机会释放该进程所占有的所有资源，并将当前进程切换到TaskInit进程。

** 最近最少使用算法
每当访问一个内存时，虚拟机都将物理页面的access位置为TRUE。同时，虚拟机维护一个时间信号，每当时钟
信号到来时，都将调用memmap\_refresh，将所有的表项的freq字段右移一位，且最高位置为accessed。
这样，freq越大，表示最近使用次数越多，反之越少。当选择牺牲页时，选择一个最小的即可。

** 内存共享
内存共享是本模拟程序提供的高级功能,通过使用共享内存，可以大幅度提高内存使用用效率。
*** fork操作
新进程建立过程中，其通过TaskInit的fork操作产生了与TaskInit指向相同页面的页目录和页表，直接共
享父进程的地址空间。

*** 加载相同程序
如果两个进程加载了相同的程序，则它们的页表在分配时会指向相同的外存块。此时调用page\_in作，会查
找对应块的引用情况，如果引用数大于０，则查找其引用的页表，检查该页是否已经被修改。如果已经修改，则
重新分配一段内存页，从外存块中将数据加载到内存；否则将新进程的页表指向对应的页面，并将进程的写时复制
置１，实现共享内存。

*** 共享页面的交换处理
本程序对共享页面进行加锁，一率不允许交换。

** 缺页处理
在任一时刻，一个进程的特定页面只可能存在４个地方：
| 1 | 外存块                              | valid=FALSE, swapped=FALSE |
| 2 | 内存中，即物理页面                  | valid=TRUE                 |
| 3 | 交换区中                           | valid=TRUE, swapped=TRUE   |
| 4 | 0区(一个虚拟的页面，其数据全部为０) | valid=FALSE, page\_ID=-1   | 

在进行缺页处理时，虚拟机会判断该页面是否可以共享页面，如果不可以，则选择一个没有使用的页面。如果
所有页面都已经使用，根据最近最少使用原则，选择一个页将其交换出内存，然后根据页面所在的位置，调用相
应的函数将数据加载到选择的空闲页面中。  

** 写时复制的实现
在每个页表项中，都有写时复制位，如果为１则表示该页处于写时复制状态。当一个进程的某个页面要和其它进
程共享页面时，所有共享该页面的进程对应的页表项都要将写时复制位置１。

进行写操作时，必须先检查该页的写时复制位，如果为０，表示没有页面共享，继续执行操作即可。如果为１，
表示*可能*还有其它进程在使用该页，进一步检查物理页面的lock字段，如果lock大于０，则该页面正被多个
进程引用，必须先将该页面复制到一个新的页面，将*当前进程*的写时复制位置０，然后才可以进行写操作；如
果lock位<1,则共享页面已经复制，只要将当前进行的该页表项写时复制位置０，就可以进写操作。

** 多道程序并发及客户终端与虚拟机通信的实现
*** 多道程序实现
虚拟机程序通过一个进程模拟，多道程序通过多个客户终端进程模拟。用户通过客户终端向虚拟机发送指令请求
。请求中包含有该进程的进程号，虚拟机程序借此对客户终端进行判别和进行进程切换操作。
*** 通信
虚拟机进程创建一个服务管道，客户终端向其中写请求，虚拟机从中读取请求并处理请求。每个客户终端有一个
命名管道，虚拟机进程处理完请求后，将应答写入对应客户进程的命名管道，客户终端读取该管道并显示。

* 运行说明
本程序的开发环境为Ubuntu11.10操作系统，采用c语言开发，使用gcc 4.6.1编译。
程序分为２个部分，分别为vmachine和tty。tty可以有多个实例用以模拟多个进程，在运行tty之前，必须
先运行vmachine。

本程序的操作命令均从tty输入，tty将请求传给vmachine进行处理，vmachine会输出详细的处理过程，并
结果发回到tty显示.

命令:
#+BEGIN_SRC -t   
    Q:         退出程序。
    R xxxx:    从地址xxxx读一字节。
    W xxxx xx: 将值xx写入地址xxxx.
    X xxxx:    执行地址xxxx的指令（实际上只做可执行权限的检查).
    E n:       加载程序n,替换当前程序。
    D:         显示当前进程的页表。
    S:         关闭模拟程序。
#+END_SRC

* 测试说明
本程序在Ubuntu11.10环境下测试。bash 版本为4.2.10.
在debug目录下可以运行debug.sh脚本自动测试，该脚本会按照debug.dat和debug2.dat中的指令向tty
输入测试指令。
用户也可以手工测试，方法为:
1. 运行vmachine
2. 运行一个或多个tty程序
3. 在tty中输入特定指令，观察程序输出。
在debug目录下的img目录中，给出了一些测试用例截图，可供参考。
    

* 总结与感想
本程序是北京航空航天大学计算机学院操作系统第３次课程设计。从编写第一行伪代码，到撰写本文档，历时２
个月。代码由田勇(39051718)完成，王博弘、梁炯潜、郭莉莎参与了讨论设计，并给出了一些很好的建议。

在设计本程序时，最初参考了实验教程上给出的程序，但很快发现该程序不能很好模拟操作系统对虚拟内存的管
理。于是决定另起炉灶，从新设计一个更加接近真实系统的模拟程序。

最初的设计是用２个文件分别模拟磁盘文件和交换区。程序中有一解释程序，可以执行事先写入磁盘文件中的由
一系列指令构成的虚拟程序。客户终端只用来控制执行哪一个程序。这样，实际上是要实现一个虚拟机。但后来
发现其工作量超出预计数倍，不得不忍痛删除大量代码，只保留与虚存管理相关的部分。从主程序名vmachine
、进程控制块task\_t、设备控制模块等处，仍可以看出当初设计的痕迹。

精简后的设计并没有简化对虚存管理的模拟。除了实现一些基础的功能以外，本程序还实现了共享内存、写时复
制等高级功能，不仅如此，对于进程的生存周期，本程序也进行了很好模拟。但同时，复杂的功能也带来了复杂
的代码和调试的困难。在本文档中，各个功能是分开描述的，但在代码中却难以分开实现。大多数情况下，多个
功能都杂糅在一起，使得对数据的操作过程十分繁琐复杂，牵一发而动全身。这样，不仅查找错误十分困难，修
改起来也不简单，往往改动一处，又导致另一处错误。因此，在提交本次作业时，可能仍然存在未发现的错误。

通过本次作业及小组讨论，本组成员对操作系统虚存管理有了更加深刻的理解，同时也掌握了程序运行的机理，
并且对Linux编程环境更加熟悉，很好的达到了本次大作业的目的。


